demoEsm/views/kips-users/index.php

SELECT * FROM `education_level` ORDER BY `id`
---
           [
                'label' => 'Class',
                'attribute' => 'studentClass.education_level',
                'filter' => Html::activeDropDownList(
                        $searchModel, 'class', ArrayHelper::map(\app\models\KipsEducationLevel::find()->orderBy('id')->asArray()->all(), 'id', 'education_level'), ['class' => 'form-control', 'prompt' => Yii::t('app', 'Please Filter')]
                )