demoEsm/views/kips-users/view.php

            'firstname',
            'surname',
            'middlename',
            [
                'attribute' => 'class',
                'label' => 'Class',
                'format' => 'raw',
                'type' => DetailView::INPUT_DROPDOWN_LIST,
                'items' => ArrayHelper::map(\app\models\KipsEducationLevel::find()->orderBy('id')->asArray()->all(), 'id', 'education_level'), 'options' => ['prompt' => 'Select Education Level'],
                'value' => $model->studentClass->education_level,
            ],
---
SELECT * FROM `education_level` WHERE `id`=2
SELECT * FROM `education_level` ORDER BY `id`

                'label' => 'Transport Route',
                'format' => 'raw',
                'type' => DetailView::INPUT_DROPDOWN_LIST,
                'items' => ArrayHelper::map(\app\models\KipsTransportRoutes::find()->orderBy('id')->asArray()->all(), 'id', 'area_covered'), 'options' => ['prompt' => 'Select Transport Route'],
---
SELECT * FROM `transport_routes` ORDER BY `id`