views/kips-users/_addPayment.php

            'payment_setup_id' => [
                'label' => 'Payment For',
                'type' => Form::INPUT_DROPDOWN_LIST,
                'items' => ArrayHelper::map(\app\models\KipsPaymentTypes::find()->orderBy('id')->asArray()->all(), 'id', 'payment_type'), 'options' => ['prompt' => 'Payment For'],
---
SELECT * FROM `payment_types` ORDER BY `id`