demoEsm/models/KipsUsers.php

SELECT * FROM `user` WHERE `userid`=2306
---
    public static function getStudentName($student_id) {
        $model = self::findOne(['userid' => $student_id]);