demoEsm/models/KipsPaymentSetup.php

    public static function getPaymentsFor($payment_setup_id) {
        $model = self::findOne(['id' => $payment_setup_id]);
---
SELECT * FROM `payment_setup` WHERE `id`=88

       public static function getPaymentSetupID($financial_year,$education_level,$payment_type,$fee_category) {
        $model = self::findOne(['financial_year_id' => $financial_year,'education_level' => $education_level,'payment_type' => $payment_type,'fee_category' => $fee_category]);
---
SELECT * FROM `education_level` WHERE `id`=1
SELECT * FROM `payment_types` WHERE `id`=1