demoEsm/models/User.php

    public static function findIdentity($id) {
        return static::findOne($id);
---
SELECT * FROM `user` WHERE `userid`=1976

    public static function findByUsername($username) {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `user` WHERE `username`='0712603045'