demoEsm/views/layouts/main.php

SELECT * FROM `financial_years` WHERE IsCurrent = 1
---
        <footer class="footer">
            <div class="container">
                &emsp;&emsp;&emsp;&emsp;&emsp;  <img src="../demo/images/logo.png" alt="Logo" height="102" width="102" style="position: absolute; top: 55px; right: 2%;" >
                <p style="text-align: center">Current logged in as <?php echo Yii::$app->user->identity->firstname . " " . Yii::$app->user->identity->surname; ?>; AY in Session: <strong><?php echo Yii::$app->session->get('mfy')->FinancialYear; ?></strong> Current AY (Operational): <strong><?php echo \app\models\FinancialYears::find()->where("IsCurrent = 1")->one()->FinancialYear; ?></strong></p>