demoEsm/controllers/KipsUsersController.php

    protected function findModel($id) {
        if (($model = KipsUsers::findOne($id)) !== null) {
---
SELECT * FROM `user` WHERE `userid`='2'