demoEsm/controllers/SiteController.php

SELECT * FROM `financial_years` WHERE IsCurrent = 1
---
    public function actionLogin() {
        if (!\Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {

            $my_details_array = [];
            Yii::$app->session->set('my_details', $my_details_array);
            Yii::$app->session->set('mfy', \app\models\FinancialYears::find()->where("IsCurrent = 1")->one());